In [18]:
people = {
    'first' : ['Riya', 'Corey', 'Jane'],
    'last' : ['Gupta', 'Doe', 'Doe'],
    'email' : ['riya.gupta@gmail.com', 'corey.doe@gmail.com', 'jane.doe@gmail.com']
}

In [19]:
import pandas as pd

In [20]:
df = pd.DataFrame(people)

In [21]:
df

   first   last                 email
0   Riya  Gupta  riya.gupta@gmail.com
1  Corey    Doe   corey.doe@gmail.com
2   Jane    Doe    jane.doe@gmail.com

In [22]:
filt = (df['last'] == 'Doe')

In [23]:
filt

0    False
1     True
2     True
Name: last, dtype: bool

In [24]:
df[filt]

   first last                email
1  Corey  Doe  corey.doe@gmail.com
2   Jane  Doe   jane.doe@gmail.com

In [25]:
df.loc[filt] #same as above

   first last                email
1  Corey  Doe  corey.doe@gmail.com
2   Jane  Doe   jane.doe@gmail.com

In [26]:
df.loc[filt, 'email']

1    corey.doe@gmail.com
2     jane.doe@gmail.com
Name: email, dtype: object

In [27]:
filt = (df['last'] == 'Doe') & (df['first'] == 'Jane')

In [28]:
filt

0    False
1    False
2     True
dtype: bool

In [29]:
df.loc[filt, 'email']

2    jane.doe@gmail.com
Name: email, dtype: object

In [31]:
## ~filt reverses the output and gives opposite result
df.loc[~filt, 'email']

0    riya.gupta@gmail.com
1     corey.doe@gmail.com
Name: email, dtype: object

In [32]:
df2 = pd.read_csv('appointment.csv')

In [33]:
df2.head()

,PatientId,AppointmentID,Gender,ScheduledDay,AppointmentDay,Age,Neighbourhood,SMS_received,No-show,PRIORITY_TYPE_CODE,Index of Multiple Deprivation Decile,Income Decile,Employment Decile,Education and Skills Decile,Health and Disability Decile,City
0,2.990000e+13,5642903,F,2016-04-29T18:38:08Z,2016-04-29T00:00:00Z,62,JARDIM DA PENHA,0,No,1.0,10.0,9.0,9.0,7.0,10.0,No
1,5.590000e+14,5642503,M,2016-04-29T16:08:27Z,2016-04-29T00:00:00Z,56,JARDIM DA PENHA,0,No,NaN,7.0,7.0,9.0,6.0,9.0,No
2,4.260000e+12,5642549,F,2016-04-29T16:19:04Z,2016-04-29T00:00:00Z,62,MATA DA PRAIA,0,No,NaN,7.0,7.0,9.0,6.0,9.0,No
3,8.680000e+11,5642828,F,2016-04-29T17:29:31Z,2016-04-29T00:00:00Z,8,PONTAL DE CAMBURI,0,No,NaN,10.0,10.0,9.0,8.0,10.0,No
4,8.840000e+12,5642494,F,2016-04-29T16:07:23Z,2016-04-29T00:00:00Z,56,JARDIM DA PENHA,0,No,NaN,10.0,10.0,10.0,10.0,10.0,No

In [35]:
old_age = (df2['Age'] > 50)

In [37]:
old_age

0         True
1         True
2         True
3        False
4         True
         ...
32392    False
32393    False
32394    False
32395     True
32396     True
Name: Age, Length: 32397, dtype: bool

In [41]:
## Show columns with age only greater than 50
df2.loc[old_age, ['AppointmentID', 'Gender', 'Neighbourhood', 'Age']]

       AppointmentID Gender    Neighbourhood  Age
0            5642903      F  JARDIM DA PENHA   62
1            5642503      M  JARDIM DA PENHA   56
2            5642549      F    MATA DA PRAIA   62
4            5642494      F  JARDIM DA PENHA   56
5            5626772      F        REPÚBLICA   76
...              ...    ...              ...  ...
32386        5650981      F       DO MOSCOSO   63
32388        5717106      F           CENTRO   53
32390        5647423      F           CENTRO   79
32395        5713273      F   PARQUE MOSCOSO   59
32396        5644851      M   PARQUE MOSCOSO   54

[9854 rows x 4 columns]

In [42]:
neighbour = ['JARDIM DA PENHA', 'MATA DA PRAIA', 'DO MOSCOSO', 'CENTRO']
filt = df2['Neighbourhood'].isin(neighbour)

In [45]:
df2.loc[filt, 'Neighbourhood']

0        JARDIM DA PENHA
1        JARDIM DA PENHA
2          MATA DA PRAIA
4        JARDIM DA PENHA
68       JARDIM DA PENHA
              ...
32387         DO MOSCOSO
32388             CENTRO
32390             CENTRO
32391             CENTRO
32394             CENTRO
Name: Neighbourhood, Length: 1575, dtype: object